{"class_name": "Model", "config": {"name": "model_51", "layers": [{"name": "input_52", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2048], "dtype": "float32", "sparse": false, "name": "input_52"}, "inbound_nodes": []}, {"name": "dense_450", "class_name": "Dense", "config": {"name": "dense_450", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_52", 0, 0, {}]]]}, {"name": "activation_399", "class_name": "Activation", "config": {"name": "activation_399", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_450", 0, 0, {}]]]}, {"name": "batch_normalization_v1_399", "class_name": "BatchNormalizationV1", "config": {"name": "batch_normalization_v1_399", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_399", 0, 0, {}]]]}, {"name": "dense_451", "class_name": "Dense", "config": {"name": "dense_451", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_v1_399", 0, 0, {}]]]}, {"name": "activation_400", "class_name": "Activation", "config": {"name": "activation_400", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_451", 0, 0, {}]]]}, {"name": "batch_normalization_v1_400", "class_name": "BatchNormalizationV1", "config": {"name": "batch_normalization_v1_400", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_400", 0, 0, {}]]]}, {"name": "dense_452", "class_name": "Dense", "config": {"name": "dense_452", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_v1_400", 0, 0, {}]]]}, {"name": "activation_401", "class_name": "Activation", "config": {"name": "activation_401", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_452", 0, 0, {}]]]}, {"name": "batch_normalization_v1_401", "class_name": "BatchNormalizationV1", "config": {"name": "batch_normalization_v1_401", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_401", 0, 0, {}]]]}, {"name": "dense_453", "class_name": "Dense", "config": {"name": "dense_453", "trainable": true, "dtype": "float32", "units": 2048, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_v1_401", 0, 0, {}]]]}, {"name": "activation_402", "class_name": "Activation", "config": {"name": "activation_402", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_453", 0, 0, {}]]]}, {"name": "batch_normalization_v1_402", "class_name": "BatchNormalizationV1", "config": {"name": "batch_normalization_v1_402", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_402", 0, 0, {}]]]}, {"name": "dense_454", "class_name": "Dense", "config": {"name": "dense_454", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_v1_402", 0, 0, {}]]]}, {"name": "activation_403", "class_name": "Activation", "config": {"name": "activation_403", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_454", 0, 0, {}]]]}, {"name": "batch_normalization_v1_403", "class_name": "BatchNormalizationV1", "config": {"name": "batch_normalization_v1_403", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_403", 0, 0, {}]]]}, {"name": "dense_455", "class_name": "Dense", "config": {"name": "dense_455", "trainable": true, "dtype": "float32", "units": 2048, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_v1_403", 0, 0, {}]]]}], "input_layers": [["input_52", 0, 0]], "output_layers": [["dense_455", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}